In [1]:
%config InlineBackend.figure_formats = {'png', 'retina'}

In [2]:
taxi = pd.read_csv("test/test.csv")

In [3]:
taxi["count"] = 1

In [4]:
import datetime as dt

In [5]:
taxi.tail()

,id,vendor_id,pickup_datetime,passenger_count,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,store_and_fwd_flag,count
625129,id3008929,1,2016-01-01 00:02:52,1,-74.003464,40.725105,-74.001251,40.733643,N,1
625130,id3700764,1,2016-01-01 00:01:52,1,-74.006363,40.743782,-73.953407,40.782467,N,1
625131,id2568735,1,2016-01-01 00:01:24,2,-73.972267,40.759865,-73.876602,40.748665,N,1
625132,id1384355,1,2016-01-01 00:00:28,1,-73.976501,40.733562,-73.854263,40.891788,N,1
625133,id0621643,2,2016-01-01 00:00:22,2,-73.981850,40.716881,-73.969330,40.769379,N,1

## pickup_datetime 살피기

In [6]:
# pd.to_datetime을 해줘야 pickup_datetime coulmn의 data type이 datetime으로 됨.
pickup_datetime_dt = pd.to_datetime(taxi["pickup_datetime"])

In [7]:
# trip_duration, count를 포함하고, pickup_datetime의 data로만 이루어진 dataframe(taxi_df1)을 만든다.
taxi_df1 = taxi.loc[:, ["trip_duration", "count"]]
taxi_df1["pickup_datetime"] = pickup_datetime_dt

In [8]:
# pickup datetime 중 year, month, day
taxi_df1.loc[:, "pickup_date"] = taxi_df1["pickup_datetime"].dt.date
# pickup datetime 중 month만 가져와서 새로 column을 만듦.
taxi_df1.loc[:, "pickup_month"] = taxi_df1["pickup_datetime"].dt.month
# pickup datetime 중 hour만 가져와서 새로 column을 만듦.
taxi_df1.loc[:, "pickup_hour"] = taxi_df1["pickup_datetime"].dt.hour
# pickup datetime 중 요일만 가져와서 새로 column을 만듦.
# 월요일은 0이고, 일요일은 6임.
taxi_df1.loc[:, "pickup_weekday"] = taxi_df1["pickup_datetime"].dt.weekday

In [9]:
taxi_df1.tail()

,trip_duration,count,pickup_datetime,pickup_date,pickup_month,pickup_hour,pickup_weekday
625129,NaN,1,2016-01-01 00:02:52,2016-01-01,1,0,4
625130,NaN,1,2016-01-01 00:01:52,2016-01-01,1,0,4
625131,NaN,1,2016-01-01 00:01:24,2016-01-01,1,0,4
625132,NaN,1,2016-01-01 00:00:28,2016-01-01,1,0,4
625133,NaN,1,2016-01-01 00:00:22,2016-01-01,1,0,4

- year 살피기

In [10]:
print(taxi_df1["pickup_datetime"].dt.year.min())
print(taxi_df1["pickup_datetime"].dt.year.max())

2016
2016

- month 살피기

In [11]:
print(taxi_df1["pickup_month"].min())
print(taxi_df1["pickup_month"].max())

1
6

In [12]:
taxi_month_1 = taxi_df1.loc[:, ["pickup_month", "count"]]
taxi_month_1.groupby("pickup_month").sum()

               count
pickup_month
1              97676
2             102314
3             109697
4             107432
5             107570
6             100445

- hour 살피기

In [15]:
print(taxi_df1["pickup_hour"].min())
print(taxi_df1["pickup_hour"].max())

0
23

In [16]:
taxi_hour_1 = taxi_df1.loc[:, ["pickup_hour", "count"]]
taxi_hour_1.groupby("pickup_hour").sum()

             count
pickup_hour
0            22714
1            16529
2            11961
3             8881
4             6814
5             6468
6            14122
7            23818
8            28854
9            29127
10           27997
11           29145
12           30448
13           30524
14           32345
15           31000
16           27714
17           32916
18           38841
19           38437
20           36295
21           35746
22           34567
23           29871

- 요일 살피기

In [19]:
print(taxi_df1["pickup_weekday"].min())
print(taxi_df1["pickup_weekday"].max())

0
6

In [20]:
taxi_weekday_1 = taxi_df1.loc[:, ["pickup_weekday", "count"]]
taxi_weekday_1.groupby("pickup_weekday").sum()

                count
pickup_weekday
0               80388
1               87318
2               89888
3               93460
4               96260
5               94232
6               83588

### EDA of pickup_datetime in test data
- year : 2016년 
- month : 1~6월
- hour : 0~23시
- weekday : 월요일~일요일